etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32H7xx/STM32H7xx_I2C.cpp
/**
 **********************************************************************************************
 *  @file           STM32F4xx_I2C.cpp C++ Implementation File for Queued I2C derived class.
 *
 *  @brief          The file shall include the definitions of all the functions described in
 *                  STM32F4xx_I2C.h file.
 *  @details
 *  @copyright      2014 Eaton Corporation. All Rights Reserved.
 *  @remark         Eaton Corporation claims proprietary rights to the material disclosed
 *                  hereon.  This technical information may not be reproduced or used
 *                  without direct written permission from Eaton Corporation.
 **********************************************************************************************
 */

#include "Includes.h"
#include "STM32H7xx_I2C.h"
#include "uC_IO_Config.h"
#include "Advanced_Vect.h"
#include "uC_Interrupt.h"
/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
STM32F4xx_I2C::STM32F4xx_I2C( class_config_t const* i2c_assy,
							  select_config_t const* const select_config ) :
	m_dummy_data( 0U ),
	m_select( select_config ),
	m_active_config( reinterpret_cast<select_config_t const*>( nullptr ) ),
	m_i2c( i2c_assy->i2c->reg_ctrl ),
	m_rx_stream( reinterpret_cast<DMA_Stream_TypeDef*>( nullptr ) ),
	m_tx_stream( reinterpret_cast<DMA_Stream_TypeDef*>( nullptr ) ),
	m_rx_dma_ctrl( reinterpret_cast<DMA_TypeDef*>( nullptr ) ),
	m_tx_dma_ctrl( reinterpret_cast<DMA_TypeDef*>( nullptr ) ),
	m_i2c_vector_obj( reinterpret_cast<Advanced_Vect*>( nullptr ) ),
	m_dma_vector_obj_tx( reinterpret_cast<Advanced_Vect*>( nullptr ) ),
	m_dma_vector_obj_rx( reinterpret_cast<Advanced_Vect*>( nullptr ) ),
	m_i2c_vector_number( NVIC_ENUM_SIZE ),
	m_dma_vector_number_tx( NVIC_ENUM_SIZE ),
	m_dma_vector_number_rx( NVIC_ENUM_SIZE ),
	m_rx_data( reinterpret_cast<uint8_t*>( nullptr ) ),
	m_tx_data( reinterpret_cast<uint8_t*>( nullptr ) ),
	m_tx_length( 0U ),
	m_rx_length( 0U ),
	m_rx_dma_id( 0U ),
	m_tx_dma_id( 0U ),
	m_data_sink( 0U ),
	state_machine( START_STATE_ACK ),
	transaction( I2C_WRITE_EXCHANGE ),
	tx_channel( 0U ),
	rx_channel( 0U ),
	dma_use( false ),
	device_address( 0x00U ),
	uC_Queued_I2C()
{

	m_i2c_vector_number = i2c_assy->i2c->irq_num;
	Initialize_Peripheral_Clock( &i2c_assy->i2c->periph_def );
	/* Configure the interrupt for I2C events */
	m_i2c_vector_obj = new Advanced_Vect();

	m_i2c_vector_obj->Set_Vect( &I2C_ISR_Static,
								static_cast<Advanced_Vect::cback_param_t>( this ) );
	uC_Interrupt::Clear_Vector( m_i2c_vector_number );
	uC_Interrupt::Set_Vector( static_cast<Advanced_Vect::int_cback_t>
							  ( m_i2c_vector_obj->Get_Int_Func() ),
							  m_i2c_vector_number, i2c_assy->int_priority );

	m_i2c->CR1 = 0U;
	m_data_sink = m_i2c->DR;
	/* Enable I2C interrupt vector event */
	uC_Interrupt::Enable_Int( m_i2c_vector_number );
	/* Basic DMA configuration */
	if ( ( nullptr != i2c_assy->rx_dma ) && ( nullptr != i2c_assy->tx_dma ) )
	{
		m_dma_vector_number_tx = i2c_assy->tx_dma->irq_num;
		m_dma_vector_number_rx = i2c_assy->rx_dma->irq_num;
		m_rx_stream = i2c_assy->rx_dma->dma_channel_ctrl;
		m_rx_dma_id = i2c_assy->rx_dma->dma_num;
		m_rx_dma_ctrl = i2c_assy->rx_dma->dma_ctrl;
		m_tx_stream = i2c_assy->tx_dma->dma_channel_ctrl;
		m_tx_dma_id = i2c_assy->tx_dma->dma_num;
		m_tx_dma_ctrl = i2c_assy->tx_dma->dma_ctrl;
		/* Initialize DMA clock */
		Initialize_Peripheral_Clock( &i2c_assy->rx_dma->periph_def );
		Initialize_Peripheral_Clock( &i2c_assy->tx_dma->periph_def );
		/* Configure the interrupt for DMA transmission complete */
		m_dma_vector_obj_tx = new Advanced_Vect();

		m_dma_vector_obj_tx->Set_Vect( &DMA_TX_ISR_Static, this );
		uC_Interrupt::Set_Vector(
			static_cast<Advanced_Vect::int_cback_t>( m_dma_vector_obj_tx->Get_Int_Func() ),
			m_dma_vector_number_tx, i2c_assy->int_priority );
		/* Configure the interrupt for DMA transmission complete */
		m_dma_vector_obj_rx = new Advanced_Vect();

		m_dma_vector_obj_rx->Set_Vect( &DMA_RX_ISR_Static, this );
		uC_Interrupt::Set_Vector(
			static_cast<Advanced_Vect::int_cback_t>( m_dma_vector_obj_rx->Get_Int_Func() ),
			m_dma_vector_number_rx, i2c_assy->int_priority );

		Clear_DMA_Interrupts();
		uC_Interrupt::Enable_Int( m_dma_vector_number_tx );
		uC_Interrupt::Enable_Int( m_dma_vector_number_rx );
		/* Extract the DMA channel that shall be use for transmission and receptuion */
		tx_channel =
			( ( ( static_cast<uint32_t>( i2c_assy->i2c->tx_dma_channel ) ) & 0xF0U ) >> 4U );
		rx_channel =
			( ( ( static_cast<uint32_t>( i2c_assy->i2c->rx_dma_channel ) ) & 0xF0U ) >> 4U );
		/* The location in Control register is from bit 25-27 */
		tx_channel <<= 25U;
		rx_channel <<= 25U;
	}
	else
	{
		m_rx_stream = reinterpret_cast<DMA_Stream_TypeDef*>( nullptr );
		m_tx_stream = reinterpret_cast<DMA_Stream_TypeDef*>( nullptr );
		m_dma_vector_obj_tx = reinterpret_cast<Advanced_Vect*>( nullptr );
		m_dma_vector_obj_rx = reinterpret_cast<Advanced_Vect*>( nullptr );
		m_rx_dma_id = 0U;
	}
	/* GPIO initialization for I2C peripheral */
	Assume_IO_Control( i2c_assy->i2c_io );
	m_active_config = reinterpret_cast<select_config_t*>( nullptr );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
STM32F4xx_I2C::~STM32F4xx_I2C( void )
{
	uC_Interrupt::Clear_Vector( m_i2c_vector_number );
	delete m_i2c_vector_obj;

	m_tx_stream->CR = 0U;
	uC_Interrupt::Clear_Vector( m_dma_vector_number_tx );
	delete m_dma_vector_obj_tx;
	delete m_tx_stream;
	delete m_tx_dma_ctrl;
	delete m_tx_data;

	m_rx_stream->CR = 0U;
	uC_Interrupt::Clear_Vector( m_dma_vector_number_rx );
	delete m_dma_vector_obj_rx;
	delete m_rx_stream;
	delete m_rx_dma_ctrl;
	delete m_rx_data;
	m_i2c->CR1 = 0U;
	m_i2c->CR2 = 0U;

	delete m_active_config;
}

