etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32H7xx/STM32H7xx_I2C.cpp
/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void STM32F4xx_I2C::Start_Exchange( bool_t new_exchange )
{
	uint32_t rx_cr_value;
	uint32_t tx_cr_value;

	state_machine = START_STATE_ACK;
	dma_use = false;
	if ( false != new_exchange )
	{
		m_active_config = m_select;
	}

	if ( true == static_cast<bool_t>( m_i2c->CR1 & I2C_CR1_PE ) )
	{
		Clr_Mask( m_i2c->CR1, I2C_CR1_PE );
	}

	m_i2c->CR2 = m_active_config->i2c_cr2;
	m_i2c->CCR = m_active_config->i2c_ccr;
	m_i2c->TRISE = m_active_config->i2c_trise;
	m_i2c->CR1 |= I2C_CR1_PE;
	m_i2c->CR1 |= m_active_config->i2c_cr1;

	device_address = m_active_segment->chip_address;
	transaction = m_active_segment->exchange_type;

	m_rx_length = m_active_segment->rx_length;
	m_tx_length = m_active_segment->tx_length;
	/* Check if DMA can be used. If not it will be interrupt based transfer */
	if ( ( nullptr == m_dma_vector_obj_tx ) ||
		 ( m_active_segment->tx_length < m_active_config->dma_byte_count_theshold ) ||
		 ( m_active_segment->rx_length < m_active_config->dma_byte_count_theshold ) )
	{
		/* Enable the interrupt events and its all over. State Machine ill take care
		   of next things */

		m_rx_data = ( nullptr == m_active_segment->rx_data ) ?
			&m_dummy_data : m_active_segment->rx_data;
		m_tx_data = ( nullptr == m_active_segment->tx_data ) ?
			&m_dummy_data : m_active_segment->tx_data;
	}
	/* Transfer using DMA */
	else
	{
		dma_use = true;

		rx_cr_value = DMA_SxCR_TCIE | DMA_SxCR_TEIE | DMA_SxCR_DMEIE | rx_channel
			| DMA_SxCR_MINC;

		tx_cr_value = DMA_SxCR_DIR_0 | DMA_SxCR_TCIE | DMA_SxCR_TEIE
			| DMA_SxCR_DMEIE | tx_channel | DMA_SxCR_MINC;

		m_rx_stream->NDTR = m_active_segment->rx_length;
		m_tx_stream->NDTR = m_active_segment->tx_length;

		/* Check if we have to receive any data in receive buffer */
		if ( nullptr != m_active_segment->rx_data )
		{
			m_rx_stream->M0AR = reinterpret_cast<uint32_t>( m_active_segment->rx_data );
			rx_cr_value |= DMA_SxCR_MINC;
		}
		else
		{
			m_rx_stream->M0AR = reinterpret_cast<uint32_t>( &m_dummy_data );
		}

		/* Check if we have to transmit any data */
		if ( nullptr != m_active_segment->tx_data )
		{
			m_tx_stream->M0AR = reinterpret_cast<uint32_t>( m_active_segment->tx_data );
			tx_cr_value |= DMA_SxCR_MINC;
		}
		else
		{
			m_tx_stream->M0AR = reinterpret_cast<uint32_t>( &m_dummy_data );
		}

		/* Disable DMA Channel for Rx Stream and assign peripheral address */
		m_rx_stream->CR &= ~( DMA_SxCR_EN );
		m_rx_stream->CR = 0U;
		m_rx_stream->PAR = reinterpret_cast<uint32_t>( &( m_i2c->DR ) );
		/* Disable DMA Channel for Rx Stream and assign peripheral address */
		m_tx_stream->CR &= ~( DMA_SxCR_EN );
		m_tx_stream->CR = 0U;
		m_tx_stream->PAR = reinterpret_cast<uint32_t>( &( m_i2c->DR ) );
		/* Enable I2C DMA transfer */
		m_i2c->CR2 |= I2C_CR2_DMAEN;
		/* Fill in the control register for DMA both RX stram and TX stream */
		m_rx_stream->CR = rx_cr_value;
		m_tx_stream->CR = tx_cr_value;

	}
	m_i2c->CR2 |= I2C_CR2_ITERREN | I2C_CR2_ITEVTEN;
	/* Flush the data register */
	m_data_sink = m_i2c->DR;
	m_i2c->CR1 |= I2C_CR1_ACK;
	/* Generate the start condition to start state machine */
	Generate_Start();
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void STM32F4xx_I2C::DMA_TX_ISR( void )
{
	bool_t failure;

	m_tx_stream->CR &= ~( static_cast<uint32_t>( DMA_SxCR_EN ) );
	m_tx_stream->CR = 0U;
	failure = Clear_DMA_Interrupts();
	/* Transmission Complete */
	if ( ( transaction == I2C_WRITE_EXCHANGE ) && ( MAX_STATE_ACK == state_machine ) )
	{
		Wait_Flag_Timeout( I2C_SR1_TXE );
		Bus_Busy_TimeOut();
		Set_Stop();
		Get_SR1();
		m_i2c->CR1 = 0U;
		m_i2c->CR2 = 0U;
		Exchange_Complete( failure );
	}
	else
	{
		m_i2c->CR2 |= ( I2C_CR2_ITERREN | I2C_CR2_ITEVTEN );
		Generate_Start();
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void STM32F4xx_I2C::DMA_RX_ISR( void )
{
	bool_t failure;

	m_rx_stream->CR &= ~( static_cast<uint32_t>( DMA_SxCR_EN ) );
	m_rx_stream->CR = 0U;
	/* Transmission Complete */
	failure = Clear_DMA_Interrupts();
	if ( transaction == I2C_READ_EXCHANGE )
	{
		Set_Stop();
		Get_SR1();
		m_i2c->CR1 = 0U;
		m_i2c->CR2 = 0U;
		Exchange_Complete( failure );
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void STM32F4xx_I2C::I2C_ISR( void )
{
	uint16_t i2c_address;

	/* It looks like a bulky ISR.
	   However from timing perspective only single  case shall be executed during one interrupt
	   The reading of SR1 and SR2 is crucial in I2C. Its not redundant code*/
	if ( dma_use == false )
	{
		switch ( state_machine )
		{	/* State for sending device address/ start frame ACK */
			case START_STATE_ACK:
				if ( true == static_cast<bool_t>( Get_SR1() & I2C_SR1_SB ) )
				{
					Get_SR2();
					/* To check if it is a 10 bit addressing mode or 7 bit addressing mode */
					if ( device_address < 0x7FU )
					{	/* 0 because its write operation */
						m_i2c->DR = static_cast<uint16_t>
							( ( device_address << 1U ) /* | 0x00U */ );
						state_machine = SET_DEVICE_ADDRESS_ACK;
					}
					else if ( ( device_address > 0x7FU ) && ( device_address < 0x3FFU ) )
					{
						i2c_address = ( ( device_address >> 8U ) & 0x03U );
						i2c_address = static_cast<uint16_t>( i2c_address << 1 );
						m_i2c->DR = ( ADDR_HEADER_10_BIT | i2c_address /* | 0x00U */ );
						state_machine = SET_ADDRESS_BYTE_2;
					}
					else
					{
						state_machine = MAX_STATE_ACK;
						Exchange_Complete( false );
					}
				}
				break;

			/* Send upper byte of an address in case of 10 bit addressing mode */
			case SET_ADDRESS_BYTE_2:
				if ( true == static_cast<bool_t>( Get_SR1() & I2C_SR1_ADD10 ) )
				{
					Get_SR2();
					i2c_address = device_address & 0xFFU;
					m_i2c->DR = i2c_address;
					state_machine = SET_DEVICE_ADDRESS_ACK;
				}
				break;

			/* Device address Acknowledge state. Also used for sendind command to device */
			case SET_DEVICE_ADDRESS_ACK:
				if ( true == static_cast<bool_t>( Get_SR1() & I2C_SR1_TXE ) )
				{
					Get_SR2();
					m_i2c->DR = *m_tx_data;
					m_tx_data += 1U;
					m_tx_length--;
					if ( transaction == I2C_WRITE_EXCHANGE )
					{
						state_machine = SEND_DATA_ACK;
					}
					else
					{
						state_machine = REPEATED_START_STATE_ACK;
					}
				}
				break;

			/* Repeated start condition in case of read mode */
			case REPEATED_START_STATE_ACK:
				if ( ( true == static_cast<bool_t>( ( Get_SR1() & I2C_SR1_BTF ) ) ) ||
					 ( true == static_cast<bool_t>( ( Get_SR1() & I2C_SR1_TXE ) ) ) )
				{
					Generate_Start();
					state_machine = REPEAT_DEVICE_ADDRESS_ACK;
				}
				break;

			/* Repeat Device address in case of I2C read mode */
			case REPEAT_DEVICE_ADDRESS_ACK:
				if ( true == static_cast<bool_t>( Get_SR1() & I2C_SR1_SB ) )
				{
					Get_SR2();
					if ( device_address < 0x7FU )
					{	/* 1 because its read operation */
						m_i2c->DR =
							( ( static_cast<uint16_t>( device_address << 1U ) ) | 0x01U );
						state_machine = RECEIVE_DATA_ACK;
					}
					else if ( ( device_address > 0x7FU ) && ( device_address < 0x3FFU ) )
					{
						i2c_address = ( ( device_address >> 8U ) & 0x03U );
						i2c_address = static_cast<uint16_t>( i2c_address << 1U );
						m_i2c->DR = ( ADDR_HEADER_10_BIT | i2c_address | 0x01U );
						state_machine = RECEIVE_DATA_ACK;
					}
					else
					{
						state_machine = MAX_STATE_ACK;
						Exchange_Complete( false );
					}
				}
				break;

			/* State for sending data to slave */
			case SEND_DATA_ACK:
				if ( ( true == static_cast<bool_t>( ( Get_SR1() & I2C_SR1_BTF ) ) ) ||
					 ( true == static_cast<bool_t>( ( Get_SR1() & I2C_SR1_TXE ) ) ) )
				{
					m_tx_length--;
					m_i2c->DR = *m_tx_data;
					m_tx_data += 1U;
					if ( m_tx_length == 0U )
					{
						state_machine = STOP_CONDITION_ACK;
					}
				}
				break;

			/* State for receiving data from slave */
			case RECEIVE_DATA_ACK:
				Get_SR2();
				if ( true == static_cast<bool_t>( Get_SR1() & I2C_SR1_RXNE ) )
				{
					*m_rx_data = static_cast<uint8_t>( m_i2c->DR );
					m_rx_length--;
					m_rx_data += 1U;
					if ( m_rx_length == 0U )
					{
						state_machine = STOP_CONDITION_ACK;
					}
					Get_SR2();
				}
				break;

